<?php
if(!isset($errormsg)){
    $errormsg = "INSUFFICIENT_RIGHT";
}
?>
<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <link rel="stylesheet" href="https://unpkg.com/bootstrap@4.4.1/dist/css/bootstrap.min.css">
    <title>This thread has been locked for edit - Labstry Forum</title>
</head>
<style>
    html,
    body {
        height: 100%;
    }
</style>

<body>
<div class="d-flex align-items-center h-100">
    <section class="w-100">
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
            <path fill="#0099ff" fill-opacity="1" d="M0,64L21.8,58.7C43.6,53,87,43,131,32C174.5,21,218,11,262,5.3C305.5,0,349,0,393,37.3C436.4,75,480,149,524,154.7C567.3,160,611,96,655,64C698.2,32,742,32,785,74.7C829.1,117,873,203,916,213.3C960,224,1004,160,1047,144C1090.9,128,1135,160,1178,160C1221.8,160,1265,128,1309,106.7C1352.7,85,1396,75,1418,69.3L1440,64L1440,320L1418.2,320C1396.4,320,1353,320,1309,320C1265.5,320,1222,320,1178,320C1134.5,320,1091,320,1047,320C1003.6,320,960,320,916,320C872.7,320,829,320,785,320C741.8,320,698,320,655,320C610.9,320,567,320,524,320C480,320,436,320,393,320C349.1,320,305,320,262,320C218.2,320,175,320,131,320C87.3,320,44,320,22,320L0,320Z"></path>
        </svg>
        <div style="background-color: #0099ff;" class="my-n3">
            <div class="container text-white">
                <h1 class="h2">😫 對唔住，show 唔到你想睇的帖子...</h1>
                <div>Error information: NO_SUCH_THREAD</div>
                <div class="my-3 op-btn">
                    <a class="btn btn-light px-4 m-2" style="border-radius: 25px" href="<?php echo BASE_URL. '/index.php'?>">返回首頁</a>
                </div>

            </div>
        </div>
        <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
            <path fill="#0099ff" fill-opacity="1" d="M0,224L26.7,197.3C53.3,171,107,117,160,96C213.3,75,267,85,320,106.7C373.3,128,427,160,480,160C533.3,160,587,128,640,144C693.3,160,747,224,800,250.7C853.3,277,907,267,960,229.3C1013.3,192,1067,128,1120,128C1173.3,128,1227,192,1280,192C1333.3,192,1387,128,1413,96L1440,64L1440,0L1413.3,0C1386.7,0,1333,0,1280,0C1226.7,0,1173,0,1120,0C1066.7,0,1013,0,960,0C906.7,0,853,0,800,0C746.7,0,693,0,640,0C586.7,0,533,0,480,0C426.7,0,373,0,320,0C266.7,0,213,0,160,0C106.7,0,53,0,27,0L0,0Z"></path>
        </svg>
    </section>
</div>


<!--
<svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 1440 320">
    <path fill="#0099ff" fill-opacity="1" d="M0,64L21.8,58.7C43.6,53,87,43,131,32C174.5,21,218,11,262,5.3C305.5,0,349,0,393,37.3C436.4,75,480,149,524,154.7C567.3,160,611,96,655,64C698.2,32,742,32,785,74.7C829.1,117,873,203,916,213.3C960,224,1004,160,1047,144C1090.9,128,1135,160,1178,160C1221.8,160,1265,128,1309,106.7C1352.7,85,1396,75,1418,69.3L1440,64L1440,0L1418.2,0C1396.4,0,1353,0,1309,0C1265.5,0,1222,0,1178,0C1134.5,0,1091,0,1047,0C1003.6,0,960,0,916,0C872.7,0,829,0,785,0C741.8,0,698,0,655,0C610.9,0,567,0,524,0C480,0,436,0,393,0C349.1,0,305,0,262,0C218.2,0,175,0,131,0C87.3,0,44,0,22,0L0,0Z"></path>
</svg>
-->
</body>
</html>
